<?php

return [
    'root' => 'Root',

    /*
        |--------------------------------------------------------------------------
        | Buttons
        |--------------------------------------------------------------------------
    */
    'button.save' => 'Сохранить',
    'button.expand_all' => 'Раскрыть все',
    'button.collapse_all' => 'Свернуть все',

    /*
        |--------------------------------------------------------------------------
        | Form
        |--------------------------------------------------------------------------
    */
    'components.tree.buttons.select_all.label' => 'Выделить все',
    'components.tree.buttons.deselect_all.label' => 'Очистить',
    'components.tree.buttons.expand_all.label' => 'Раскрыть все',
    'components.tree.buttons.collapse_all.label' => 'Свернуть все',

    /*
        |--------------------------------------------------------------------------
        | Message
        |--------------------------------------------------------------------------
    */
    'actions.delete.confirmation.with_children' => 'ВНИМАНИЕ! Удаляя этот элемент, Вы также удаляете и все его дочерние элементы',
];
